# SpecTypeId Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId Class
Members See Also
---
This class contains constants identifying specs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static class SpecTypeId
```

Visual Basic
---
```text
Public NotInheritable Class SpecTypeId
```

Visual C++
---
```text
public ref class SpecTypeId abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SpecTypeId
# See Also
SpecTypeId Members
Autodesk.Revit.DB Namespace